---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.Clear
source: html/fd52ef85-8fb6-f740-d26b-649fe5d3513f.htm
---
# Autodesk.Revit.DB.ReferencePointArray.Clear Method

Removes every reference from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```